; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        ; (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=5, packages=10, locations=12, max_capacity=2, out_folder=training/easy, instance_id=58, seed=99

(define (problem transport-58)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c2)
    (capacity v3 c1)
    (capacity v4 c1)
    (capacity v5 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l4)
    (at p2 l3)
    (at p3 l2)
    (at p4 l5)
    (at p5 l12)
    (at p6 l7)
    (at p7 l9)
    (at p8 l11)
    (at p9 l12)
    (at p10 l9)
    (at v1 l2)
    (at v2 l10)
    (at v3 l8)
    (at v4 l4)
    (at v5 l7)
    (road l3 l4)
    (road l4 l3)
    (road l3 l1)
    (road l9 l5)
    (road l8 l3)
    (road l11 l2)
    (road l2 l11)
    (road l1 l3)
    (road l6 l5)
    (road l12 l3)
    (road l5 l6)
    (road l3 l12)
    (road l5 l9)
    (road l8 l5)
    (road l3 l2)
    (road l4 l10)
    (road l3 l8)
    (road l5 l8)
    (road l8 l7)
    (road l10 l4)
    (road l2 l3)
    (road l7 l8)
    (road l9 l12)
    (road l12 l9)
    (road l7 l11)
    (road l11 l7)
    (road l8 l10)
    (road l10 l8)
    (road l6 l8)
    (road l8 l6)
    (road l4 l5)
    (road l5 l4)
    (road l9 l10)
    (road l10 l9)
    (road l7 l12)
    (road l12 l7)
    (road l1 l9)
    (road l9 l1)
    (road l2 l12)
    (road l12 l2)
    (road l10 l11)
    (road l11 l10)
    (road l2 l8)
    (road l8 l2)
    (road l3 l5)
    (road l5 l3)
    (road l4 l6)
    (road l6 l4)
    (road l2 l9)
    (road l9 l2)
    (road l8 l9)
    (road l9 l8)
    (road l5 l7)
    (road l7 l5)
    (road l2 l10)
    (road l10 l2)
    (road l10 l12)
    (road l12 l10)
    (road l6 l9)
    (road l9 l6)
    (road l8 l12)
    (road l12 l8)
    (road l1 l2)
    (road l2 l1)
    (road l3 l6)
    (road l6 l3)
    (road l1 l12)
    (road l12 l1)
    (road l1 l7)
    (road l7 l1)
    (road l4 l8)
    (road l8 l4)
    (road l3 l7)
    (road l7 l3)
    (road l6 l12)
    (road l12 l6)
    )
 (:goal  (and 
    (at p1 l12)
    (at p2 l12)
    (at p3 l10)
    (at p4 l12)
    (at p5 l3)
    (at p6 l10)
    (at p7 l7)
    (at p8 l2)
    (at p9 l2)
    (at p10 l2))))

; plan
1. (drive v1 l2 l3)
   deleted: (at v1 l2)
   added: (at v1 l3)
   goals met: 0 of 10
2. (drive v1 l3 l4)
   deleted: (at v1 l3)
   added: (at v1 l4)
   goals met: 0 of 10
3. (pick-up v1 l4 p1 c1 c2)
   deleted: (at p1 l4) (capacity v1 c2)
   added: (in p1 v1) (capacity v1 c1)
   goals met: 0 of 10
4. (drive v1 l4 l3)
   deleted: (at v1 l4)
   added: (at v1 l3)
   goals met: 0 of 10
5. (drive v1 l3 l12)
   deleted: (at v1 l3)
   added: (at v1 l12)
   goals met: 0 of 10
6. (drop v1 l12 p1 c1 c2)
   deleted: (in p1 v1) (capacity v1 c1)
   added: (at p1 l12) (capacity v1 c2)
   goals met: 1 of 10
7. (drive v1 l12 l3)
   deleted: (at v1 l12)
   added: (at v1 l3)
   goals met: 1 of 10
8. (pick-up v1 l3 p2 c1 c2)
   deleted: (at p2 l3) (capacity v1 c2)
   added: (in p2 v1) (capacity v1 c1)
   goals met: 1 of 10
9. (drive v1 l3 l12)
   deleted: (at v1 l3)
   added: (at v1 l12)
   goals met: 1 of 10
10. (drop v1 l12 p2 c1 c2)
   deleted: (in p2 v1) (capacity v1 c1)
   added: (at p2 l12) (capacity v1 c2)
   goals met: 2 of 10
11. (drive v1 l12 l2)
   deleted: (at v1 l12)
   added: (at v1 l2)
   goals met: 2 of 10
12. (pick-up v1 l2 p3 c1 c2)
   deleted: (at p3 l2) (capacity v1 c2)
   added: (in p3 v1) (capacity v1 c1)
   goals met: 2 of 10
13. (drive v1 l2 l10)
   deleted: (at v1 l2)
   added: (at v1 l10)
   goals met: 2 of 10
14. (drop v1 l10 p3 c1 c2)
   deleted: (in p3 v1) (capacity v1 c1)
   added: (at p3 l10) (capacity v1 c2)
   goals met: 3 of 10
15. (drive v1 l10 l4)
   deleted: (at v1 l10)
   added: (at v1 l4)
   goals met: 3 of 10
16. (drive v1 l4 l5)
   deleted: (at v1 l4)
   added: (at v1 l5)
   goals met: 3 of 10
17. (pick-up v1 l5 p4 c1 c2)
   deleted: (at p4 l5) (capacity v1 c2)
   added: (in p4 v1) (capacity v1 c1)
   goals met: 3 of 10
18. (drive v1 l5 l6)
   deleted: (at v1 l5)
   added: (at v1 l6)
   goals met: 3 of 10
19. (drive v1 l6 l12)
   deleted: (at v1 l6)
   added: (at v1 l12)
   goals met: 3 of 10
20. (drop v1 l12 p4 c1 c2)
   deleted: (in p4 v1) (capacity v1 c1)
   added: (at p4 l12) (capacity v1 c2)
   goals met: 4 of 10
21. (pick-up v1 l12 p5 c1 c2)
   deleted: (at p5 l12) (capacity v1 c2)
   added: (in p5 v1) (capacity v1 c1)
   goals met: 4 of 10
22. (drive v1 l12 l3)
   deleted: (at v1 l12)
   added: (at v1 l3)
   goals met: 4 of 10
23. (drop v1 l3 p5 c1 c2)
   deleted: (in p5 v1) (capacity v1 c1)
   added: (at p5 l3) (capacity v1 c2)
   goals met: 5 of 10
24. (drive v1 l3 l7)
   deleted: (at v1 l3)
   added: (at v1 l7)
   goals met: 5 of 10
25. (pick-up v1 l7 p6 c1 c2)
   deleted: (at p6 l7) (capacity v1 c2)
   added: (in p6 v1) (capacity v1 c1)
   goals met: 5 of 10
26. (drive v1 l7 l8)
   deleted: (at v1 l7)
   added: (at v1 l8)
   goals met: 5 of 10
27. (drive v1 l8 l10)
   deleted: (at v1 l8)
   added: (at v1 l10)
   goals met: 5 of 10
28. (drop v1 l10 p6 c1 c2)
   deleted: (in p6 v1) (capacity v1 c1)
   added: (at p6 l10) (capacity v1 c2)
   goals met: 6 of 10
29. (drive v1 l10 l9)
   deleted: (at v1 l10)
   added: (at v1 l9)
   goals met: 6 of 10
30. (pick-up v1 l9 p7 c1 c2)
   deleted: (at p7 l9) (capacity v1 c2)
   added: (in p7 v1) (capacity v1 c1)
   goals met: 6 of 10
31. (drive v1 l9 l5)
   deleted: (at v1 l9)
   added: (at v1 l5)
   goals met: 6 of 10
32. (drive v1 l5 l7)
   deleted: (at v1 l5)
   added: (at v1 l7)
   goals met: 6 of 10
33. (drop v1 l7 p7 c1 c2)
   deleted: (in p7 v1) (capacity v1 c1)
   added: (at p7 l7) (capacity v1 c2)
   goals met: 7 of 10
34. (drive v1 l7 l11)
   deleted: (at v1 l7)
   added: (at v1 l11)
   goals met: 7 of 10
35. (pick-up v1 l11 p8 c1 c2)
   deleted: (at p8 l11) (capacity v1 c2)
   added: (in p8 v1) (capacity v1 c1)
   goals met: 7 of 10
36. (drive v1 l11 l2)
   deleted: (at v1 l11)
   added: (at v1 l2)
   goals met: 7 of 10
37. (drop v1 l2 p8 c1 c2)
   deleted: (in p8 v1) (capacity v1 c1)
   added: (at p8 l2) (capacity v1 c2)
   goals met: 8 of 10
38. (drive v1 l2 l12)
   deleted: (at v1 l2)
   added: (at v1 l12)
   goals met: 8 of 10
39. (pick-up v1 l12 p9 c1 c2)
   deleted: (at p9 l12) (capacity v1 c2)
   added: (in p9 v1) (capacity v1 c1)
   goals met: 8 of 10
40. (drive v1 l12 l2)
   deleted: (at v1 l12)
   added: (at v1 l2)
   goals met: 8 of 10
41. (drop v1 l2 p9 c1 c2)
   deleted: (in p9 v1) (capacity v1 c1)
   added: (at p9 l2) (capacity v1 c2)
   goals met: 9 of 10
42. (drive v1 l2 l9)
   deleted: (at v1 l2)
   added: (at v1 l9)
   goals met: 9 of 10
43. (pick-up v1 l9 p10 c1 c2)
   deleted: (at p10 l9) (capacity v1 c2)
   added: (in p10 v1) (capacity v1 c1)
   goals met: 9 of 10
44. (drive v1 l9 l2)
   deleted: (at v1 l9)
   added: (at v1 l2)
   goals met: 9 of 10
45. (drop v1 l2 p10 c1 c2)
   deleted: (in p10 v1) (capacity v1 c1)
   added: (at p10 l2) (capacity v1 c2)
   goals met: 10 of 10
